Namespace:   Autodesk.Revit.DB.ExternalService
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static ExternalServiceId SnappingService { get; }
  Visual Basic
Public Shared ReadOnly Property SnappingService As ExternalServiceId
	Get
  Visual C++
public:
static property ExternalServiceId^ SnappingService {
	ExternalServiceId^ get ();
}
 See Also
  ExternalServices BuiltInExternalServices Class
  Autodesk.Revit.DB.ExternalService Namespace